def fun(arg1,arg2):
    print('arg1',arg1)
    print('arg2',arg2)
    arg1 =100
    arg2.insert(0,10)
    print('arg1',arg1)
    print('arg2',arg2)

fun(10,[20,30,40]) #位置传参
# arg2 [20, 30, 40]
# arg1 100
# arg2 [10, 20, 30, 40]

n1 = 11
n2 = [22,33,44]
fun(n1,n2)
print('n1',n1)
print('n2',n2)
# arg1 11
# arg2 [22, 33, 44]
# arg1 100
# arg2 [10, 22, 33, 44]
# n1 11  <--并不是意料中的100
# n2 [10, 22, 33, 44]
'''
在函数调用过程中，进行参数的传递
如果是不可变对象，在函数体的修改不会影响实参的值
如果是可变对象，在函数体的修改会影响实参的值（例如n2，转变成了[10,22,33,44]）
不可变对象（数字，字符串）'''
